In [ ]:
'''1. Is gender independent of education level? A random sample of 395 people were surveyed
and each person was asked to report the highest education level they obtained. The data that
resulted from the survey is summarized in the following table:
High School Bachelors Masters Ph.d. Total
Female 60 54 46 41 201
Male 40 44 53 57 194
Total 100 98 99 98 395
Question: Are gender and education level dependent at 5% level of significance? In other
words, given the data collected above, is there a relationship between the gender of an
individual and the level of education that they have obtained?'''

In [ ]:
#Chi-Square test of independence
#H0 :Null Hypothesis: The two categorical variables are independent.
#H1:Alternative Hypothesis: The two categorical variables are dependent.

In [1]:
import numpy as np
import pandas as pd
import scipy.stats as stats

In [6]:
female=[60,54,46,41]
male=[40,44,53,57]
marks=male+female
print(marks)
gender=['Male','Male','Male','Male','Female','Female','Female','Female']
education=['High School', 'Bachelors', 'Masters', 'Ph.d.','High School', 'Bachelors', 'Masters', 'Ph.d.']
df_education = pd.DataFrame({"Gender":gender,"Education":education,"Marks":marks})
print(df_education)

[40, 44, 53, 57, 60, 54, 46, 41]
   Gender    Education  Marks
0    Male  High School     40
1    Male    Bachelors     44
2    Male      Masters     53
3    Male        Ph.d.     57
4  Female  High School     60
5  Female    Bachelors     54
6  Female      Masters     46
7  Female        Ph.d.     41

In [8]:
df2=cross_tab = pd.crosstab(df_education.Gender, df_education.Education,df_education.Marks, aggfunc="sum",margins=True)
df2

Education  Bachelors  High School  Masters  Ph.d.  All
Gender
Female            54           60       46     41  201
Male              44           40       53     57  194
All               98          100       99     98  395

In [10]:
df2.columns = ["Bachelors","High School","Masters","Ph.d.","row_totals"]

df2.index = ["Female","Male","col_totals"]
df2

            Bachelors  High School  Masters  Ph.d.  row_totals
Female             54           60       46     41         201
Male               44           40       53     57         194
col_totals         98          100       99     98         395

In [11]:
observed = df2.iloc[0:2,0:4]
observed

        Bachelors  High School  Masters  Ph.d.
Female         54           60       46     41
Male           44           40       53     57

In [12]:
expected =  np.outer(df2["row_totals"][0:2],
                     df2.loc["col_totals"][0:4]) / 395.0
expected = pd.DataFrame(expected)
expected.columns = ["Bachelors","High School","Masters","Ph.d."]
expected.index = ["Female","Male"]
expected

        Bachelors  High School    Masters      Ph.d.
Female  49.868354    50.886076  50.377215  49.868354
Male    48.131646    49.113924  48.622785  48.131646

In [13]:
chi_squared_stat = (((observed-expected)**2)/expected).sum().sum()

print(chi_squared_stat)

8.006066246262538

In [15]:
critical = stats.chi2.ppf(q = 0.95, df = 3)  

print("Critical value", critical)

p_value = 1 - stats.chi2.cdf(x=chi_squared_stat,  df=3)
print("P value", p_value)

Critical value 7.814727903251179
P value 0.04588650089174717

In [16]:
stats.chi2_contingency(observed= observed)

(8.006066246262538,
 0.045886500891747214,
 3,
 array([[49.86835443, 50.88607595, 50.37721519, 49.86835443],
        [48.13164557, 49.11392405, 48.62278481, 48.13164557]]))

In [ ]:
#reject the null hypothesis as 8.006 > 7.814

In [ ]:
'''2. Using the following data, perform a oneway analysis of variance using Î±=.05. Write up the
results in APA format.

[Group1: 51, 45, 33, 45, 67]
[Group2: 23, 43, 23, 43, 45]
[Group3: 56, 76, 74, 87, 56]'''

In [17]:
import scipy.stats as stats
Group1 = [51, 45, 33, 45, 67]
Group2 = [23, 43, 23, 43, 45]
Group3 = [56, 76, 74, 87, 56]
statistic, pvalue = stats.f_oneway(Group1,Group2,Group3)
print("F Statistic value {} , p-value {}".format(statistic,pvalue))
if pvalue < 0.05:
    print('True')
else:
    print('False')

F Statistic value 9.747205503009463 , p-value 0.0030597541434430556
True

In [ ]:
'''3. Calculate F Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25.

For 10, 20, 30, 40, 50:'''

In [18]:
a=[10, 20, 30, 40, 50]
b=[5,10,15, 20, 25]
stats.f_oneway(a,b)

F_onewayResult(statistic=3.6, pvalue=0.0943497728424377)